wub163/XW_0011_F_0162_V1.0.0/MM32F0160_Device/MM32F0160/HAL_lib/inc/hal_tim.h
/*
 *******************************************************************************
    @file     hal_tim.h
    @author   AE TEAM
    @brief    THIS FILE CONTAINS ALL THE FUNCTIONS PROTOTYPES FOR THE ADC
              FIRMWARE LIBRARY.
 *******************************************************************************
    @attention

    <h2><center>&copy; Copyright(c) <2023> <MindMotion></center></h2>

    Redistribution and use in source and binary forms, with or without
    modification, are permitted provided that the
    following conditions are met:
    1. Redistributions of source code must retain the above copyright notice,
       this list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its
       contributors may be used to endorse or promote products derived from this
       software without specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
    AND ANY EXPRESS OR IMPLIED WARRANTIES,INCLUDING, BUT NOT LIMITED TO,
    THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
    PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR
    CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
    EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
    PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
    OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
    WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
    OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF
    ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *******************************************************************************
 */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __HAL_TIM_H
#define __HAL_TIM_H

#ifdef __cplusplus
extern "C" {
#endif

/* Files includes ------------------------------------------------------------*/
#include "mm32_device.h"

/** @addtogroup MM32_Hardware_Abstract_Layer
  * @{
  */

/** @defgroup TIM_HAL
  * @brief TIM HAL modules
  * @{
  */

/** @defgroup TIM_Exported_Types
  * @{
  */

/**
  * @brief TIM_Channel
  * @anchor TIM_Channel
  */
typedef enum {
    TIM_Channel_1                       = 0x0000,                               /*!< TIM Channel 1 */
    TIM_Channel_2                       = 0x0004,                               /*!< TIM Channel 2 */
    TIM_Channel_3                       = 0x0008,                               /*!< TIM Channel 3 */
    TIM_Channel_4                       = 0x000C,                               /*!< TIM Channel 4 */
    TIM_Channel_5                       = 0x0010                                /*!< TIM Channel 5 */
} TIMCHx_Typedef;

/**
  * @brief TIM_Counter_Mode
  * @anchor TIM_Counter_Mode
  */
typedef enum {
    TIM_CounterMode_Up                  = 0x0000,                               /*!< TIM Up Counting Mode */
    TIM_CounterMode_Down                = TIM_CR1_DIR,                          /*!< TIM Down Counting Mode */
    TIM_CounterMode_CenterAligned1      = TIM_CR1_CMS_CENTERALIGNED1,           /*!< TIM Center Aligned Mode1 */
    TIM_CounterMode_CenterAligned2      = TIM_CR1_CMS_CENTERALIGNED2,           /*!< TIM Center Aligned Mode2 */
    TIM_CounterMode_CenterAligned3      = TIM_CR1_CMS_CENTERALIGNED3            /*!< TIM Center Aligned Mode3 */
} TIMCOUNTMODE_Typedef;

/**
  * @brief TIM_Output_Compare_and_PWM_modes_and_Forced_Action
  * @anchor TIM_Output_Compare_and_PWM_modes_and_Forced_Action
  */
typedef enum {
    TIM_OCMode_Timing                   = 0x0000,                               /*!< Output compare mode: Timing */
    TIM_OCMode_Active                   = 0x0010,                               /*!< Output compare mode: Active */
    TIM_OCMode_Inactive                 = 0x0020,                               /*!< Output compare mode: Inactive */
    TIM_OCMode_Toggle                   = 0x0030,                               /*!< Output compare mode: Toggle */
    TIM_OCMode_PWM1                     = 0x0060,                               /*!< Output compare mode: PWM1 */
    TIM_OCMode_PWM2                     = 0x0070,                               /*!< Output compare mode: PWM2 */
    TIM_ForcedAction_Active             = 0x0050,                               /*!< Force active level on OCnREF */
    TIM_ForcedAction_InActive           = 0x0040                                /*!< Force inactive level on OCnREF */
} TIMOCMODE_Typedef;

/**
  * @brief TIM_Clock_Division_CKD
  * @anchor TIM_Clock_Division_CKD
  */
typedef enum {
    TIM_CKD_DIV1                        = TIM_CR1_CKD_DIV1,                     /*!< TDTS = Tck_tim */
    TIM_CKD_DIV2                        = TIM_CR1_CKD_DIV2,                     /*!< TDTS = 2 * Tck_tim */
    TIM_CKD_DIV4                        = TIM_CR1_CKD_DIV4                      /*!< TDTS = 4 * Tck_tim */
} TIMCKD_TypeDef;

/**
  * @brief TIM_Internal_Trigger_Selection
  * @anchor TIM_Internal_Trigger_Selection
  */
typedef enum {
    TIM_TS_ITR0                         = TIM_SMCR_TS_ITR0,                     /*!< Internal Trigger 0 */
    TIM_TS_ITR1                         = TIM_SMCR_TS_ITR1,                     /*!< Internal Trigger 1 */
    TIM_TS_ITR2                         = TIM_SMCR_TS_ITR2,                     /*!< Internal Trigger 2 */
    TIM_TS_ITR3                         = TIM_SMCR_TS_ITR3,                     /*!< Internal Trigger 3 */
    TIM_TS_TI1F_ED                      = TIM_SMCR_TS_TI1F_ED,                  /*!< TI1 Edge Detector */
    TIM_TS_TI1FP1                       = TIM_SMCR_TS_TI1FP1,                   /*!< Filtered Timer Input 1 */
    TIM_TS_TI2FP2                       = TIM_SMCR_TS_TI2FP2,                   /*!< Filtered Timer Input 2 */
    TIM_TS_ETRF                         = TIM_SMCR_ETF                          /*!< TI1 Edge Detector */
} TIMTS_TypeDef;

/**
  * @brief TIM_Trigger_Output_Source
  * @anchor TIM_Trigger_Output_Source
  */
typedef enum {
    TIM_TRIGSource_Reset                = TIM_CR2_MMS_RESET,                    /*!< The UG bit in the TIM_EGR register is used as the trigger output (TRIG). */
    TIM_TRIGSource_Enable               = TIM_CR2_MMS_ENABLE,                   /*!< The Counter Enable CEN is used as the trigger output (TRIG). */
    TIM_TRIGSource_Update               = TIM_CR2_MMS_UPDATE,                   /*!< The update event is used as the trigger output (TRIG). */
    TIM_TRIGSource_OC1                  = TIM_CR2_MMS_OC1,                      /*!< The trigger output sends a positive pulse when the CC1IF flag */
    /*!< is to be set, as soon as a capture or compare match occurs (TRIG). */
    TIM_TRIGSource_OC1Ref               = TIM_CR2_MMS_OC1REF,                   /*!< OC1REF signal is used as the trigger output (TRIG). */
    TIM_TRIGSource_OC2Ref               = TIM_CR2_MMS_OC2REF,                   /*!< OC2REF signal is used as the trigger output (TRIG). */
    TIM_TRIGSource_OC3Ref               = TIM_CR2_MMS_OC3REF,                   /*!< OC3REF signal is used as the trigger output (TRIG). */
    TIM_TRIGSource_OC4Ref               = TIM_CR2_MMS_OC4REF                    /*!< OC4REF signal is used as the trigger output (TRIG). */
} TIMMMS_Typedef;

/**
  * @brief TIM_Slave_Mode
  * @anchor TIM_Slave_Mode
  */
typedef enum {
    TIM_SlaveMode_Reset                 = TIM_SMCR_SMS_RESET,                   /*!< Rising edge of the selected trigger signal (TRGI) re-initializes */
    /*!< the counter and triggers an update of the registers. */
    TIM_SlaveMode_Gated                 = TIM_SMCR_SMS_GATED,                   /*!< The counter clock is enabled when the trigger signal (TRGI) is high. */
    TIM_SlaveMode_Trigger               = TIM_SMCR_SMS_TRIGGER,                 /*!< The counter starts at a rising edge of the trigger TRGI. */
    TIM_SlaveMode_External1             = TIM_SMCR_SMS_EXTERNAL1                /*!< Rising edges of the selected trigger (TRGI) clock the counter. */
} TIMSMSMODE_Typedef;

/**
  * @brief TIM_Event_Source
  * @anchor TIM_Event_Source
  */
typedef enum {
    TIM_EventSource_Update              = TIM_EGR_UG,                           /*!< Timer update Event source */
    TIM_EventSource_CC1                 = TIM_EGR_CC1G,                         /*!< Timer Capture Compare 1 Event source */
    TIM_EventSource_CC2                 = TIM_EGR_CC2G,                         /*!< Timer Capture Compare 2 Event source */
    TIM_EventSource_CC3                 = TIM_EGR_CC3G,                         /*!< Timer Capture Compare 3 Event source */
    TIM_EventSource_CC4                 = TIM_EGR_CC4G,                         /*!< Timer Capture Compare 4 Event source */
    TIM_EventSource_COM                 = TIM_EGR_COMG,                         /*!< Timer COM event source */
    TIM_EventSource_Trigger             = TIM_EGR_TG,                           /*!< Timer Trigger Event source */
    TIM_EventSource_Break               = TIM_EGR_BG,                           /*!< Timer Break event source */
    TIM_EventSource_CC5                 = (s32)0x00010000,                      /*!< Timer Capture Compare 5 Event source */
} TIMEGR_Typedef;

/**
  * @brief TIM_External_Trigger_Prescaler
  * @anchor TIM_External_Trigger_Prescaler
  */
typedef enum {
    TIM_ExtTRGPSC_OFF                   = TIM_SMCR_ETPS_OFF,                    /*!< ETRP Prescaler OFF */
    TIM_ExtTRGPSC_DIV2                  = TIM_SMCR_ETPS_DIV2,                   /*!< ETRP frequency divided by 2 */
    TIM_ExtTRGPSC_DIV4                  = TIM_SMCR_ETPS_DIV4,                   /*!< ETRP frequency divided by 4 */
    TIM_ExtTRGPSC_DIV8                  = TIM_SMCR_ETPS_DIV8                    /*!< ETRP frequency divided by 8 */
} TIMEXTTRGPSC_Typedef;

/**
  * @brief TIM_TIx_External_Clock_Source
  * @anchor TIM_TIx_External_Clock_Source
  */
typedef enum {
    TIM_TIxExternalCLK1Source_TI1       = TIM_SMCR_TS_TI1FP1,                   /*!< Filtered Timer Input 1 */
    TIM_TIxExternalCLK1Source_TI2       = TIM_SMCR_TS_TI2FP2,                   /*!< Filtered Timer Input 2 */
    TIM_TIxExternalCLK1Source_TI1ED     = TIM_SMCR_TS_TI1F_ED                   /*!< TI1 Edge Detector */
} TIM_TIEXTCLKSRC_Typedef;

/**
  * @brief Lock_level
  * @anchor Lock_level
  */
typedef enum {
    TIM_LOCKLevel_OFF                   = TIM_BDTR_LOCK_OFF,                    /*!< No bit is write protected. */
    TIM_LOCKLevel_1                     = TIM_BDTR_LOCK_1,                      /*!< DTG bits in TIMx_BDTR register, OISx and OISxN bits in TIMx_CR2 */
    /*!< register and BKE/BKP/AOE bits in TIMx_BDTR register can no longer be written. */
    TIM_LOCKLevel_2                     = TIM_BDTR_LOCK_2,                      /*!< LOCK Level 1 + CC Polarity bits (CCxP/CCxNP bits in TIMx_CCER */
    /*!< register, as s32 as the related channel is configured in output through the CCxS */
    /*!< bits) as well as OSSR and OSSI bits can no longer be written. */
    TIM_LOCKLevel_3                     = TIM_BDTR_LOCK_3                       /*!< LOCK Level 2 + CC Control bits (OCxM and OCxPE bits in TIMx_CCMRx registers, */
                                          /*!< as s32 as the related channel is configured in output through the CCxS bits) */
                                          /*!< can no longer be written. */
} TIMLOCKLEVEL_Typedef;

/**
  * @brief TIM_One_Pulse_Mode
  * @anchor TIM_One_Pulse_Mode
  */
typedef enum {
    TIM_OPMode_Repetitive               = 0,                                    /*!< Counter is not stopped at update event */
    TIM_OPMode_Single                   = TIM_CR1_OPM                           /*!< Counter stops counting at the next update event (clearing the bit CEN) */
} TIMOPMODE_Typedef;

/**
  * @brief TIM_Output_Compare_Polarity
  * @anchor TIM_Output_Compare_Polarity
  */
typedef enum {
    TIM_OCPolarity_High,                                                        /*!< Output Compare active high */
    TIM_OCPolarity_Low                  = TIM_CCER_CC1P                         /*!< Output Compare active low */
} TIMCCxP_Typedef;

/**
  * @brief TIM_Output_Compare_N_Polarity
  * @anchor TIM_Output_Compare_N_Polarity
  */
typedef enum {
    TIM_OCNPolarity_High,                                                       /*< Output Compare active high */
    TIM_OCNPolarity_Low                 = TIM_CCER_CC1NP                        /*< Output Compare active low */
} TIMCCxNP_Typedef;

/**
  * @brief TIM_Output_Compare_state
  * @anchor TIM_Output_Compare_state
  */
typedef enum {
    TIM_OutputState_Disable             = 0,                                    /*!< Output Compare Disable */
    TIM_OutputState_Enable              = TIM_CCER_CC1E                         /*!< Output Compare Enable */
} TIMOUTPUTSTATE_Typedef;

/**
  * @brief TIM_Output_Compare_N_state
  * @anchor TIM_Output_Compare_N_state
  */
typedef enum {
    TIM_OutputNState_Disable            = 0,                                    /*!< Output Compare N Disable */
    TIM_OutputNState_Enable             = TIM_CCER_CC1NE                        /*!< Output Compare N Enable */
} TIMOUTPUTNSTATE_Typedef;

/**
  * @brief TIM_Capture_Compare_state
  * @anchor TIM_Capture_Compare_state
  */
typedef enum {
    TIM_CCx_Disable                     = 0,                                    /*!< Capture/Compare Enable */
    TIM_CCx_Enable                      = TIM_CCER_CC1E                         /*!< Capture/Compare Enable */
} TIMCCxE_Typedef;

/**
  * @brief TIM_Capture_Compare_N_state
  * @anchor TIM_Capture_Compare_N_state
  */
typedef enum {
    TIM_CCxN_Disable                    = 0,                                    /*!< Capture/Compare N Enable */
    TIM_CCxN_Enable                     = TIM_CCER_CC1NE                        /*!< Capture/Compare N Enable */
} TIMCCxNE_Typedef;

/**
  * @brief Break_Input_enable_disable
  * @anchor Break_Input_enable_disable
  */
typedef enum {
    TIM_Break_Disable                   = 0,                                    /*!< Break inputs (BRK and CSS clock failure event) disabled */
    TIM_Break_Enable                    = TIM_BDTR_BKE                          /*!< Break inputs (BRK and CSS clock failure event) enabled */
} TIMBKE_Typedef;

/**
  * @brief Break_Polarity
  * @anchor Break_Polarity
  */
typedef enum {
    TIM_BreakPolarity_Low               = 0,                                    /*!< Break input BRK is active low */
    TIM_BreakPolarity_High              = TIM_BDTR_BKP                          /*!< Break input BRK is active high */
} TIMBKP_Typedef;

/**
  * @brief TIM_AOE_Bit_Set_Reset
  * @anchor TIM_AOE_Bit_Set_Reset
  */
typedef enum {
    TIM_AutomaticOutput_Disable         = 0,                                    /*!< MOE can be set only by software. */
    TIM_AutomaticOutput_Enable          = TIM_BDTR_AOE                          /*!< MOE can be set by software or automatically at the next */
                                          /*!< update event (if the Break input is not be active). */
} TIMAOE_Typedef;

/**
  * @brief TIM_DOE_Bit_Set_Reset
  * @anchor TIM_DOE_Bit_Set_Reset
  */
typedef enum {
    TIM_DirectOutput_Disable            = 0,                                    /*!< Direct output disable, output waiting for dead time */
    TIM_DirectOutput_Enable             = TIM_BDTR_DOE                          /*!< Direct output enable, no longer waiting for output after dead time */
} TIMDOE_Typedef;

/**
  * @brief OSSI_Off_State_Selection_for_Idle_mode_state
  * @anchor OSSI_Off_State_Selection_for_Idle_mode_state
  */
typedef enum {
    TIM_OSSIState_Disable               = 0,                                    /*!< When inactive, OC/OCN outputs are disabled (OC/OCN enable output signal=0). */
    TIM_OSSIState_Enable                = TIM_BDTR_OSSI                         /*!< When inactive, OC/OCN outputs are forced first with their idle level */
                                          /*!< as soon as CCxE=1 or CCxNE=1. OC/OCN enable output signal=1). */
} TIMOSSI_Typedef;

/**
  * @brief OSSR_Off_State_Selection_for_Run_mode_state
  * @anchor OSSR_Off_State_Selection_for_Run_mode_state
  */
typedef enum {
    TIM_OSSRState_Disable               = 0,                                    /*!< When inactive, OC/OCN outputs are disabled (OC/OCN enable output signal=0). */
    TIM_OSSRState_Enable                = TIM_BDTR_OSSR                         /*!< When inactive, OC/OCN outputs are enabled with their inactive level */
                                          /*!< as soon as CCxE=1 or CCxNE=1. Then, OC/OCN enable output signal=1. */
} TIMOSSR_Typedef;

/**
  * @brief TIM_Output_Compare_Idle_State
  * @anchor TIM_Output_Compare_Idle_State
  */
typedef enum {
    TIM_OCIdleState_Reset               = 0,                                    /*!< OCn=0 (after a dead-time if OCnN is implemented) when MOE=0.(n= 0 : 4) */
    TIM_OCIdleState_Set                 = TIM_CR2_OIS1                          /*!< OCn=1 (after a dead-time if OCnN is implemented) when MOE=0.(n= 0 : 4) */
} TIMOIS_Typedef;

/**
  * @brief TIM_Output_Compare_N_Idle_State
  * @anchor TIM_Output_Compare_N_Idle_State
  */
typedef enum {
    TIM_OCNIdleState_Reset              = 0,                                    /*!< OCnN=0 after a dead-time when MOE=0.(n= 0 : 4) */
    TIM_OCNIdleState_Set                = TIM_CR2_OIS1N                         /*!< OCnN=1 after a dead-time when MOE=0.(n= 0 : 4) */
} TIMOISN_Typedef;

/**
  * @brief TIM_Input_Capture_Selection
  * @anchor TIM_Input_Capture_Selection
  */
typedef enum {
    TIM_ICSelection_DirectTI            = TIM_CCMR1_CC1S_TI1,
    TIM_ICSelection_IndirectTI          = TIM_CCMR1_CC1S_TI2,
    TIM_ICSelection_TRC                 = TIM_CCMR1_CC1S_TRC                    /*!< TIM Input is selected to be connected to TRC. */
} TIMICSEL_Typedef;

/**
  * @brief TIM_Input_Capture_Prescaler
  * @anchor TIM_Input_Capture_Prescaler
  */
typedef enum {
    TIM_ICPSC_DIV1                      = 0x0000,                               /*!< no prescaler */
    TIM_ICPSC_DIV2                      = 0x0004,                               /*!< capture is done once every 2 events */
    TIM_ICPSC_DIV4                      = 0x0008,                               /*!< capture is done once every 4 events */
    TIM_ICPSC_DIV8                      = 0x000C                                /*!< capture is done once every 8 events */
} TIMICPSC_Typedef;

/**
  * @brief TIM_Input_Capture_Polarity
  * @anchor TIM_Input_Capture_Polarity
  */
typedef enum {
    TIM_ICPolarity_Rising               = 0,                                    /*!< IC Rising edge */
    TIM_ICPolarity_Falling              = TIM_CCER_CC1P,                        /*!< IC Falling edge */
    TIM_ICPolarity_BothEdge             = TIM_CCER_CC1P | TIM_CCER_CC1NP
} TIMICP_Typedef;

/**
  * @brief TIM_External_Trigger_Polarity
  * @anchor TIM_External_Trigger_Polarity
  */
typedef enum {
    TIM_ExtTRGPolarity_NonInverted      = 0,                                    /*!< Active high or rising edge active */
    TIM_ExtTRGPolarity_Inverted         = TIM_SMCR_ETP                          /*!< Active low or falling edge active */
} TIMETP_Typedef;

/**
  * @brief TIM_Prescaler_Reload_Mode
  * @anchor TIM_Prescaler_Reload_Mode
  */
typedef enum {
    TIM_PSCReloadMode_Update            = 0,                                    /*!< The Prescaler is loaded at the update event */
    TIM_PSCReloadMode_Immediate         = TIM_EGR_UG                            /*!< The Prescaler is loaded immediately */
} TIMUG_Typedef;

/**
  * @brief TIM_Encoder_Mode
  * @anchor TIM_Encoder_Mode
  */
typedef enum {
    TIM_EncoderMode_TI1                 = TIM_SMCR_SMS_ENCODER1,                /*!< Counter counts on TI1FP1 edge depending on TI2FP2 level. */
    TIM_EncoderMode_TI2                 = TIM_SMCR_SMS_ENCODER2,                /*!< Counter counts on TI2FP2 edge depending on TI1FP1 level. */
    TIM_EncoderMode_TI12                = TIM_SMCR_SMS_ENCODER3                 /*!< Counter counts on both TI1FP1 and TI2FP2 edges depending */
                                          /*!< on the level of the other input. */
} TIMSMSENCODER_Typedef;

/**
  * @brief TIM_Update_Source
  * @anchor TIM_Update_Source
  */
typedef enum {
    TIM_UpdateSource_Global             = 0,                                    /*!< Source of update is counter overflow/underflow. */
    TIM_UpdateSource_Regular            = TIM_CR1_URS                           /*!< Source of update is the counter overflow/underflow */
                                          /*!< or the setting of UG bit, or an update generation */
                                          /*!< through the slave mode controller. */
} TIMURS_Typedef;

/**
  * @brief TIM_Output_Compare_Preload_State
  * @anchor TIM_Output_Compare_Preload_State
  */
typedef enum {
    TIM_OCPreload_Disable               = 0,                                    /*!< TIM output compare preload disable */
    TIM_OCPreload_Enable                = TIM_CCMR1_OC1PE                       /*!< TIM output compare preload enable */
} TIMOCPE_Typedef;

/**
  * @brief TIM_Output_Compare_Fast_State
  * @anchor TIM_Output_Compare_Fast_State
  */
typedef enum {
    TIM_OCFast_Disable                  = 0,                                    /*!< TIM output compare fast disable */
    TIM_OCFast_Enable                   = TIM_CCMR1_OC1FE                       /*!< TIM output compare fast enable */
} TIMOCFE_Typedef;

/**
  * @brief TIM_Output_Compare_Clear_State
  * @anchor TIM_Output_Compare_Clear_State
  */
typedef enum {
    TIM_OCClear_Disable                 = 0,                                    /*!< TIM Output clear disable */
    TIM_OCClear_Enable                  = TIM_CCMR1_OC1CE                       /*!< TIM Output clear enable */
} TIMOCCE_Typedef;

/**
  * @brief TIM_Master_Slave_Mode
  * @anchor TIM_Master_Slave_Mode
  */
typedef enum {
    TIM_MasterSlaveMode_Disable         = 0,                                    /*!< No action */
    TIM_MasterSlaveMode_Enable          = TIM_SMCR_MSM                          /*!< synchronization between the current timer and its slaves (through TRIG) */
} TIMMSM_Typedef;

/**
  * @brief TIM_interrupt_sources
  * @anchor TIM_Master_Slave_Mode
  */
typedef enum {
    TIM_IT_Update                       = TIM_DIER_UIE,                         /*!< TIM update Interrupt source */
    TIM_IT_CC1                          = TIM_DIER_CC1IE,                       /*!< TIM Capture Compare 1 Interrupt source */
    TIM_IT_CC2                          = TIM_DIER_CC2IE,                       /*!< TIM Capture Compare 2 Interrupt source */
    TIM_IT_CC3                          = TIM_DIER_CC3IE,                       /*!< TIM Capture Compare 3 Interrupt source */
    TIM_IT_CC4                          = TIM_DIER_CC4IE,                       /*!< TIM Capture Compare 4 Interrupt source */
    TIM_IT_COM                          = TIM_DIER_COMIE,                       /*!< TIM Commutation Interrupt source */
    TIM_IT_Trigger                      = TIM_DIER_TIE,                         /*!< TIM Trigger Interrupt source */
    TIM_IT_Break                        = TIM_DIER_BIE,                         /*!< TIM Break Interrupt source */
    TIM_IT_CC5                          = TIM_DIER_CC5IE                        /*!< TIM Capture Compare 5 Interrupt source */
} TIMIT_TypeDef;

