wub163/XW_0011_F_0162_V1.0.0/MM32F0160_Device/MM32F0160/HAL_lib/inc/hal_tim.h
/**
  * @brief TIM_Flags
  * @anchor TIM_Flags
  */
typedef enum {
    TIM_FLAG_Update                     = TIM_SR_UIF,                           /*!< TIM update Flag */
    TIM_FLAG_CC1                        = TIM_SR_CC1IF,                         /*!< TIM Capture Compare 1 Flag */
    TIM_FLAG_CC2                        = TIM_SR_CC2IF,                         /*!< TIM Capture Compare 2 Flag */
    TIM_FLAG_CC3                        = TIM_SR_CC3IF,                         /*!< TIM Capture Compare 3 Flag */
    TIM_FLAG_CC4                        = TIM_SR_CC4IF,                         /*!< TIM Capture Compare 4 Flag */
    TIM_FLAG_COM                        = TIM_SR_COMIF,                         /*!< TIM Commutation Flag */
    TIM_FLAG_Trigger                    = TIM_SR_TIF,                           /*!< TIM Trigger Flag */
    TIM_FLAG_Break                      = TIM_SR_BIF,                           /*!< TIM Break Flag */
    TIM_FLAG_CC1OF                      = TIM_SR_CC1OF,                         /*!< TIM Capture Compare 1 overcapture Flag */
    TIM_FLAG_CC2OF                      = TIM_SR_CC2OF,                         /*!< TIM Capture Compare 2 overcapture Flag */
    TIM_FLAG_CC3OF                      = TIM_SR_CC3OF,                         /*!< TIM Capture Compare 3 overcapture Flag */
    TIM_FLAG_CC4OF                      = TIM_SR_CC4OF,                         /*!< TIM Capture Compare 4 overcapture Flag */
    TIM_FLAG_CC5                        = TIM_SR_CC5IF                          /*!< TIM Capture Compare 5 Flag */
} TIMFLAG_Typedef;

/**
  * @brief TIM_DMA_sources
  * @anchor TIM_DMA_sources
  */
typedef enum {
    TIM_DMA_Update                      = TIM_DIER_UDE,                         /*!< TIM update Interrupt source */
    TIM_DMA_CC1                         = TIM_DIER_CC1DE,                       /*!< TIM Capture Compare 1 DMA source */
    TIM_DMA_CC2                         = TIM_DIER_CC2DE,                       /*!< TIM Capture Compare 2 DMA source */
    TIM_DMA_CC3                         = TIM_DIER_CC3DE,                       /*!< TIM Capture Compare 3 DMA source */
    TIM_DMA_CC4                         = TIM_DIER_CC4DE,                       /*!< TIM Capture Compare 4 DMA source */
    TIM_DMA_COM                         = TIM_DIER_COMDE,                       /*!< TIM Commutation DMA source */
    TIM_DMA_Trigger                     = TIM_DIER_TDE,                         /*!< TIM Trigger DMA source */
    TIM_DMA_CC5                         = TIM_DIER_CC5DE                        /*!< TIM Capture Compare 5 DMA source */
} TIMDMASRC_Typedef;

/**
  * @brief TIM_DMA_Base_address
  * @anchor TIM_DMA_Base_address
  */
typedef enum {
    TIM_DMABase_CR1                     = 0x0000,
    TIM_DMABase_CR2                     = 0x0001,
    TIM_DMABase_SMCR                    = 0x0002,
    TIM_DMABase_DIER                    = 0x0003,
    TIM_DMABase_SR                      = 0x0004,
    TIM_DMABase_EGR                     = 0x0005,
    TIM_DMABase_CCMR1                   = 0x0006,
    TIM_DMABase_CCMR2                   = 0x0007,
    TIM_DMABase_CCER                    = 0x0008,
    TIM_DMABase_CNT                     = 0x0009,
    TIM_DMABase_PSC                     = 0x000A,
    TIM_DMABase_ARR                     = 0x000B,
    TIM_DMABase_RCR                     = 0x000C,
    TIM_DMABase_CCR1                    = 0x000D,
    TIM_DMABase_CCR2                    = 0x000E,
    TIM_DMABase_CCR3                    = 0x000F,
    TIM_DMABase_CCR4                    = 0x0010,
    TIM_DMABase_BDTR                    = 0x0011,
    TIM_DMABase_DCR                     = 0x0012
} TIMDMABASE_Typedef;

/**
  * @brief TIM_DMA_Burst_Length
  * @anchor TIM_DMA_Burst_Length
  */
typedef enum {
    TIM_DMABurstLength_1Byte            = 0x0000,
    TIM_DMABurstLength_2Bytes           = 0x0100,
    TIM_DMABurstLength_3Bytes           = 0x0200,
    TIM_DMABurstLength_4Bytes           = 0x0300,
    TIM_DMABurstLength_5Bytes           = 0x0400,
    TIM_DMABurstLength_6Bytes           = 0x0500,
    TIM_DMABurstLength_7Bytes           = 0x0600,
    TIM_DMABurstLength_8Bytes           = 0x0700,
    TIM_DMABurstLength_9Bytes           = 0x0800,
    TIM_DMABurstLength_10Bytes          = 0x0900,
    TIM_DMABurstLength_11Bytes          = 0x0A00,
    TIM_DMABurstLength_12Bytes          = 0x0B00,
    TIM_DMABurstLength_13Bytes          = 0x0C00,
    TIM_DMABurstLength_14Bytes          = 0x0D00,
    TIM_DMABurstLength_15Bytes          = 0x0E00,
    TIM_DMABurstLength_16Bytes          = 0x0F00,
    TIM_DMABurstLength_17Bytes          = 0x1000,
    TIM_DMABurstLength_18Bytes          = 0x1100
} TIMDMABURSTLENGTH_Typedef;

/**
  * @brief  TIM Time Base Init structure definition
  * @note   This structure is used with all tim.
  */
typedef struct {
    uint16_t                                 TIM_Prescaler;                          /*!< Specifies the prescaler value used to divide the TIM clock. */
    /*!< This parameter can be a number between 0x0000 and 0xFFFF */
    TIMCOUNTMODE_Typedef                TIM_CounterMode;                             /*!< Specifies the counter mode. */
    /*!< This parameter can be a value of @ref TIM_Counter_Mode */
    uint32_t                                 TIM_Period;                             /*!< Specifies the period value to be loaded into the active */
    /*!< Auto-Reload Register at the next update event. */
    /*!< This parameter must be a numver between 0x0000 & 0xFFFF/0xFFFFFFFF. */
    /*!< @note 0xFFFFFFFFF is valid only for MM32 32 bit Timers: eg. TIM2 / TIM5. */
    TIMCKD_TypeDef                      TIM_ClockDivision;                           /*!< Specifies the clock division. */
    /*!< This parameter can be a value of @ref TIM_Clock_Division_CKD */
    uint8_t                                  TIM_RepetitionCounter;                  /*!< Specifies the repetition counter value. Each time the RCR downcounter */
    /*!< reaches zero, an update event is generated and counting restarts */
    /*!< from the RCR value (N). */
    /*!< This means in PWM mode that (N+1) corresponds to: */
    /*!< - the number of PWM periods in edge-aligned mode */
    /*!< - the number of half PWM period in center-aligned mode */
    /*!< This parameter must be a number between 0x00 and 0xFF. */
    /*!< @note This parameter is valid only for TIM1 and TIM8. */
} TIM_TimeBaseInitTypeDef;

/**
  * @brief  TIM Output Compare Init structure definition
  */
typedef struct {
    TIMOCMODE_Typedef                   TIM_OCMode;                             /*!< Specifies the TIM mode. */
    /*!< This parameter can be a value of TIM_Output_Compare_and_PWM_modes */
    TIMOUTPUTSTATE_Typedef              TIM_OutputState;                        /*!< Specifies the TIM Output Compare state. */
    /*!< This parameter can be a value of TIM_Output_Compare_state */
    TIMOUTPUTNSTATE_Typedef             TIM_OutputNState;                       /*!< Specifies the TIM complementary Output Compare state. */
    /*!< This parameter can be a value of TIM_Output_Compare_N_state */
    /*!< @note This parameter is valid only for TIM1 and TIM8. */
    uint32_t                                 TIM_Pulse;                              /*!< Specifies the pulse value to be loaded into the Capture Compare Register. */
    /*!< This parameter can be a number between 0x0000 and 0xFFFF/0xFFFFFFFF */
    /*!< @note 0xFFFFFFFF is only valid for MM32 32-bit timers: eg. TIM2 or TIM5. */
    TIMCCxP_Typedef                     TIM_OCPolarity;                         /*!< Specifies the output polarity. */
    /*!< This parameter can be a value of @ref TIM_Output_Compare_Polarity */
    TIMCCxNP_Typedef                    TIM_OCNPolarity;                        /*!< Specifies the complementary output polarity. */
    /*!< This parameter can be a value of @ref TIM_Output_Compare_N_Polarity */
    /*!< @note This parameter is valid only for TIM1 and TIM8. */
    TIMOIS_Typedef                      TIM_OCIdleState;                        /*!< Specifies the TIM Output Compare pin state during Idle state. */
    /*!< This parameter can be a value of @ref TIM_Output_Compare_Idle_State */
    /*!< @note This parameter is valid only for TIM1 and TIM8. */
    TIMOISN_Typedef                     TIM_OCNIdleState;                       /*!< Specifies the TIM Output Compare pin state during Idle state. */
    /*!< This parameter can be a value of @ref TIM_Output_Compare_N_Idle_State */
    /*!< @note This parameter is valid only for TIM1 and TIM8. */
} TIM_OCInitTypeDef;

/**
  * @brief  TIM Input Capture Init structure definition
  */
typedef struct {
    TIMCHx_Typedef                      TIM_Channel;                            /*!< Specifies the TIM channel. */
    /*!< This parameter can be a value of @ref TIM_Channel */
    TIMICP_Typedef                      TIM_ICPolarity;                         /*!< Specifies the active edge of the input signal. */
    /*!< This parameter can be a value of @ref TIM_Input_Capture_Polarity */
    TIMICSEL_Typedef                    TIM_ICSelection;                        /*!< Specifies the input. */
    /*!< This parameter can be a value of @ref TIM_Input_Capture_Selection */
    TIMICPSC_Typedef                    TIM_ICPrescaler;                        /*!< Specifies the Input Capture Prescaler. */
    /*!< This parameter can be a value of @ref TIM_Input_Capture_Prescaler */
    uint16_t                                 TIM_ICFilter;                           /*!< Specifies the input capture filter. */
    /*!< This parameter can be a number between 0x0 and 0xF */
} TIM_ICInitTypeDef;

/**
  * @brief  BDTR structure definition
  * @note   This structure is used only with TIM1 and TIM8.
  */
typedef struct {
    TIMOSSR_Typedef                     TIM_OSSRState;                          /*!< Specifies the Off-State selection used in Run mode. */
    /*!< This parameter can be a value of @ref OSSR_Off_State_Selection_for_Run_mode_state */
    TIMOSSI_Typedef                     TIM_OSSIState;                          /*!< Specifies the Off-State used in Idle state. */
    /*!< This parameter can be a value of @ref OSSI_Off_State_Selection_for_Idle_mode_state */
    TIMLOCKLEVEL_Typedef                TIM_LOCKLevel;                          /*!< Specifies the LOCK level parameters. */
    /*!< This parameter can be a value of @ref Lock_level */
    uint16_t                                 TIM_DeadTime;                           /*!< Specifies the delay time between the switching-off and */
    /*!< the switching-on of the outputs. */
    /*!< This parameter can be a number between 0x00 and 0xFF */
    TIMBKE_Typedef                      TIM_Break;                              /*!< Specifies whether the TIM Break input is enabled or not. */
    /*!< This parameter can be a value of @ref Break_Input_enable_disable */
    TIMBKP_Typedef                      TIM_BreakPolarity;                      /*!< Specifies the TIM Break input pin polarity. */
    /*!< This parameter can be a value of @ref Break_Polarity */
    TIMAOE_Typedef                      TIM_AutomaticOutput;                    /*!< Specifies whether the TIM Automatic Output feature is enabled or not. */
    /*!< This parameter can be a value of @ref TIM_AOE_Bit_Set_Reset */
} TIM_BDTRInitTypeDef;
/**
  * @}
  */

/** @defgroup TIM_Exported_Variables
  * @{
  */
#ifdef _HAL_TIM_C_
#define GLOBAL

static void TI1_Configure(TIM_TypeDef* tim, uint16_t polarity, uint16_t selection, uint16_t filter);
static void TI2_Configure(TIM_TypeDef* tim, uint16_t polarity, uint16_t selection, uint16_t filter);
static void TI3_Configure(TIM_TypeDef* tim, uint16_t polarity, uint16_t selection, uint16_t filter);
static void TI4_Configure(TIM_TypeDef* tim, uint16_t polarity, uint16_t selection, uint16_t filter);

#else
#define GLOBAL extern
#endif

